# Задача 24: В фермерском хозяйстве в Карелии выращивают чернику.
# Она растет на круглой грядке, причем кусты высажены только по окружности.
# Таким образом, у каждого куста есть ровно два соседних. Всего на грядке растет N кустов.
# Эти кусты обладают разной урожайностью, поэтому ко времени сбора на них выросло
# различное число ягод – на i-ом кусте выросло ai ягод.
# В этом фермерском хозяйстве внедрена система автоматического сбора черники.
# Эта система состоит из управляющего модуля и нескольких собирающих модулей.
# Собирающий модуль за один заход, находясь непосредственно перед некоторым кустом,
# собирает ягоды с этого куста и с двух соседних с ним.

# Напишите программу для нахождения максимального числа ягод, которое может собрать
# за один заход собирающий модуль, находясь перед некоторым кустом заданной во входном
# файле грядки. | 4 -> 1 2 3 4
# 9 |

n = int(input('Введите кол-во кустов: '))
list1 = [int(i) for i in input('Введите число ягод на каждом кусте: ')]
print(list1)
max_berries = 0
for i in range(len(list1)):
    if i == len(list1) - 1:
        total_berries = list1[i - 1] + list1[i] + list1[0]
    else:
        total_berries = list1[i - 1] + list1[i] + list1[i + 1]
    if total_berries > max_berries:
        max_berries = total_berries
    else:
        max_berries
print(max_berries)